# Problem_Set_03

In [1]:
#importing all the libraries
import pandas as pd
import sqlite3
import numpy as np

#installing ipython-sql library 
!pip install ipython-sql

df = pd.read_csv(r'/Users/sushantkumbhar/Documents/Stevens Academics/Skills Imporvement/SQL/SQL practice/Day_03_Practice/Dataset/Dataset_03.csv')

cnn = sqlite3.connect('Problem_set_03.db')

df.to_sql('station',cnn)

%load_ext sql

%sql sqlite:///Problem_set_03.db

%%sql

SELECT * FROM station;

## Problem 1: Query the following two values from the STATION table:
#### o The sum of all values in LAT_N rounded to a scale of 2 decimal places.
#### o The sum of all values in LONG_W rounded to a scale of 2 decimal places.

In [13]:
%%sql

SELECT ROUND(SUM(LAT_N),2) AS Total_LAT_N, ROUND(SUM(LONG_W),2) AS Total_LONG_W
FROM station;

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
Done.

[(257100.24, 284288.85)]

## Problem 2: Query the sum of Northern Latitudes (LAT_N) from STATION having values greater than 38.7880 and less than 137.2345. Truncate your answer to 4 decimal places.

In [18]:
%%sql

SELECT SUM(LAT_N) AS SUM FROM station
WHERE LAT_N BETWEEN 38.7880 AND 137.2345;

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
Done.

[(218128.88107704034,)]

## Problem 3: Query the greatest value of the Northern Latitudes (LAT_N) from STATION that is less than 137.2345. Truncate your answer to 4 decimal places.

In [20]:
%%sql

SELECT MAX(LAT_N) LAT_N FROM station
WHERE LAT_N< 137.2345;

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
Done.

[(137.0193079,)]

## Problem 4: Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than 137.2345 . Round your answer to 4 decimal places.

In [23]:
%%sql

SELECT ROUND(LONG_W,2) Max_Long_W
FROM station
WHERE LAT_N<137.2345 
ORDER BY LAT_N DESC
LIMIT 1;

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
Done.

[(117.25,)]

## Problem 5: Query the smallest Northern Latitude (LAT_N) from STATION that is greater than 38.7880 . Round your answer to 4 decimal places.¶

In [26]:
%%sql

SELECT ROUND(MIN(LAT_N),4) AS "Smallest_above_38.7880"
FROM station
WHERE LAT_N>38.7880;

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
Done.

[(38.8526,)]

## Problem 6: Query the Western Longitude (LONG_W) where the smallest Northern Latitude (LAT_N) in STATION is greater than 38.7880 . Round your answer to 4 decimal places.

In [30]:
%%sql

SELECT ROUND(LONG_W,4) AS LONG_W
FROM 
(SELECT *
FROM station
WHERE LAT_N>38.7880
)
ORDER BY LAT_N DESC
LIMIT 1;

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
Done.

[(120.8801,)]

In [31]:

%%sql
select round(LONG_W,4) as "Smallest value" from STATION 
  where LAT_N=(select min(LAT_N) from STATION
                where LAT_N>38.7880)

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
Done.

[(70.1378,), (70.1378,), (70.1378,), (70.1378,), (70.1378,), (70.1378,)]

## Problem 7: Consider P1(a,b) and P2(c,d) to be two points on a 2D plane.
#### • a happens to equal the minimum value in Northern Latitude (LAT_N in STATION).
#### • b happens to equal the minimum value in Western Longitude (LONG_W in STATION).
#### • c happens to equal the maximum value in Northern Latitude (LAT_N in STATION).
#### • d happens to equal the maximum value in Western Longitude (LONG_W in STATION).
## Query the Manhattan Distance between points P1 and P2 and round it to a scale of 4 decimal places.

In [38]:
%%sql

SELECT ROUND((ABS(MIN(LAT_N)-MAX(LAT_N))+ABS(MIN(LONG_W)-MAX(LONG_W))),4) AS Manhattan_Distance
FROM station;

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
Done.

[(259.6859,)]

## Problem 8: Consider P1(a,c) and P2(b,d) to be two points on a 2D plane where (a,b) are the respective minimum and maximum values of Northern Latitude (LAT_N) and (c,d) are the respective minimum and maximum values of Western Longitude (LONG_W) in STATION.
## Query the Euclidean Distance between points P1 and P2 and format your answer to display 4 decimal digits

In [40]:
%%sql

SELECT ROUND(SQRT(POW(MIN(LAT_N)-MAX(LAT_N),2)+POW(MIN(LONG_W)-MAX(LONG_W),2)),4)
FROM station;

   sqlite:///Problem_set_01.db
 * sqlite:///Problem_set_03.db
(sqlite3.OperationalError) no such function: SQRT
[SQL: SELECT ROUND(SQRT(POW(MIN(LAT_N)-MAX(LAT_N),2)+POW(MIN(LONG_W)-MAX(LONG_W),2)),4) FROM station;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

### The above querry works but the sqlite3 isn't supporting the sqrt function